mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xl/common/s6e2c1xl.h
typedef struct stc_hsspi_txe_field
{
        __IO  uint32_t  TFFE                     :1;
        __IO  uint32_t  TFEE                     :1;
        __IO  uint32_t  TFOE                     :1;
        __IO  uint32_t  TFUE                     :1;
        __IO  uint32_t  TFLETE                   :1;
        __IO  uint32_t  TFMTE                    :1;
        __IO  uint32_t  TSSRE                    :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_hsspi_txe_field_t;

typedef struct stc_hsspi_txc_field
{
        __IO  uint32_t  TFFC                     :1;
        __IO  uint32_t  TFEC                     :1;
        __IO  uint32_t  TFOC                     :1;
        __IO  uint32_t  TFUC                     :1;
        __IO  uint32_t  TFLETC                   :1;
        __IO  uint32_t  TFMTC                    :1;
        __IO  uint32_t  TSSRC                    :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_hsspi_txc_field_t;

typedef struct stc_hsspi_rxf_field
{
        __IO  uint32_t  RFFS                     :1;
        __IO  uint32_t  RFES                     :1;
        __IO  uint32_t  RFOS                     :1;
        __IO  uint32_t  RFUS                     :1;
        __IO  uint32_t  RFLETS                   :1;
        __IO  uint32_t  RFMTS                    :1;
        __IO  uint32_t  RSSRS                    :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_hsspi_rxf_field_t;

typedef struct stc_hsspi_rxe_field
{
        __IO  uint32_t  RFFE                     :1;
        __IO  uint32_t  RFEE                     :1;
        __IO  uint32_t  RFOE                     :1;
        __IO  uint32_t  RFUE                     :1;
        __IO  uint32_t  RFLETE                   :1;
        __IO  uint32_t  RFMTE                    :1;
        __IO  uint32_t  RSSRE                    :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_hsspi_rxe_field_t;

typedef struct stc_hsspi_rxc_field
{
        __IO  uint32_t  RFFC                     :1;
        __IO  uint32_t  RFEC                     :1;
        __IO  uint32_t  RFOC                     :1;
        __IO  uint32_t  RFUC                     :1;
        __IO  uint32_t  RFLETC                   :1;
        __IO  uint32_t  RFMTC                    :1;
        __IO  uint32_t  RSSRC                    :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_hsspi_rxc_field_t;

typedef struct stc_hsspi_faultf_field
{
        __IO  uint32_t  UMAFS                    :1;
        __IO  uint32_t  WAFS                     :1;
        __IO  uint32_t  PVFS                     :1;
        __IO  uint32_t  DWCBSFS                  :1;
        __IO  uint32_t  DRCBSFS                  :1;
        __IO  uint32_t  RESERVED0                :27;
} stc_hsspi_faultf_field_t;

typedef struct stc_hsspi_faultc_field
{
        __IO  uint32_t  UMAFC                    :1;
        __IO  uint32_t  WAFC                     :1;
        __IO  uint32_t  PVFC                     :1;
        __IO  uint32_t  DWCBSFC                  :1;
        __IO  uint32_t  DRCBSFC                  :1;
        __IO  uint32_t  RESERVED0                :27;
} stc_hsspi_faultc_field_t;

typedef struct stc_hsspi_dmcfg_field
{
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  SSDC                     :1;
        __IO   uint8_t  RESERVED1                :6;
} stc_hsspi_dmcfg_field_t;

typedef struct stc_hsspi_dmdmaen_field
{
        __IO   uint8_t  RXDMAEN                  :1;
        __IO   uint8_t  TXDMAEN                  :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_hsspi_dmdmaen_field_t;

typedef struct stc_hsspi_dmstart_field
{
        __IO   uint8_t  START                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_hsspi_dmstart_field_t;

typedef struct stc_hsspi_dmstop_field
{
        __IO   uint8_t  STOP                     :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_hsspi_dmstop_field_t;

typedef struct stc_hsspi_dmpsel_field
{
    union {
        struct {
            __IO   uint8_t  PSEL                 :2;
            __IO   uint8_t  RESERVED0            :6;
        };
        struct {
            __IO   uint8_t  PSEL0                :1;
            __IO   uint8_t  PSEL1                :1;
            __IO   uint8_t  RESERVED1            :6;
        };
    };
} stc_hsspi_dmpsel_field_t;

typedef struct stc_hsspi_dmtrp_field
{
    union {
        struct {
            __IO   uint8_t  TRP                  :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  TRP0                 :1;
            __IO   uint8_t  TRP1                 :1;
            __IO   uint8_t  TRP2                 :1;
            __IO   uint8_t  TRP3                 :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_hsspi_dmtrp_field_t;

typedef struct stc_hsspi_dmbcc_field
{
    union {
        struct {
            __IO  uint16_t  BCC                  :16;
        };
        struct {
            __IO  uint16_t  BCC0                 :1;
            __IO  uint16_t  BCC1                 :1;
            __IO  uint16_t  BCC2                 :1;
            __IO  uint16_t  BCC3                 :1;
            __IO  uint16_t  BCC4                 :1;
            __IO  uint16_t  BCC5                 :1;
            __IO  uint16_t  BCC6                 :1;
            __IO  uint16_t  BCC7                 :1;
            __IO  uint16_t  BCC8                 :1;
            __IO  uint16_t  BCC9                 :1;
            __IO  uint16_t  BCC10                :1;
            __IO  uint16_t  BCC11                :1;
            __IO  uint16_t  BCC12                :1;
            __IO  uint16_t  BCC13                :1;
            __IO  uint16_t  BCC14                :1;
            __IO  uint16_t  BCC15                :1;
        };
    };
} stc_hsspi_dmbcc_field_t;

typedef struct stc_hsspi_dmbcs_field
{
    union {
        struct {
            __IO  uint16_t  BCS                  :16;
        };
        struct {
            __IO  uint16_t  BCS0                 :1;
            __IO  uint16_t  BCS1                 :1;
            __IO  uint16_t  BCS2                 :1;
            __IO  uint16_t  BCS3                 :1;
            __IO  uint16_t  BCS4                 :1;
            __IO  uint16_t  BCS5                 :1;
            __IO  uint16_t  BCS6                 :1;
            __IO  uint16_t  BCS7                 :1;
            __IO  uint16_t  BCS8                 :1;
            __IO  uint16_t  BCS9                 :1;
            __IO  uint16_t  BCS10                :1;
            __IO  uint16_t  BCS11                :1;
            __IO  uint16_t  BCS12                :1;
            __IO  uint16_t  BCS13                :1;
            __IO  uint16_t  BCS14                :1;
            __IO  uint16_t  BCS15                :1;
        };
    };
} stc_hsspi_dmbcs_field_t;

