mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xl/common/s6e2c1xl.h
/*******************************************************************************
* HWWDT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WDG_LDR;
        struct {
          union {
            __IO uint16_t WDG_LDRL;
            struct {
              __IO uint8_t WDG_LDRLL;
              __IO uint8_t WDG_LDRLH;
            };
          };
          union {
            __IO uint16_t WDG_LDRH;
            struct {
              __IO uint8_t WDG_LDRHL;
              __IO uint8_t WDG_LDRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_VLR;
        struct {
          union {
            __IO uint16_t WDG_VLRL;
            struct {
              __IO uint8_t WDG_VLRLL;
              __IO uint8_t WDG_VLRLH;
            };
          };
          union {
            __IO uint16_t WDG_VLRH;
            struct {
              __IO uint8_t WDG_VLRHL;
              __IO uint8_t WDG_VLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_CTL;
        stc_hwwdt_wdg_ctl_field_t WDG_CTL_f;
        struct {
          union {
            __IO uint16_t WDG_CTLL;
            struct {
              __IO uint8_t WDG_CTLLL;
              __IO uint8_t WDG_CTLLH;
            };
          };
          union {
            __IO uint16_t WDG_CTLH;
            struct {
              __IO uint8_t WDG_CTLHL;
              __IO uint8_t WDG_CTLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_ICL;
        struct {
          union {
            __IO uint16_t WDG_ICLL;
            struct {
              __IO uint8_t WDG_ICLLL;
              __IO uint8_t WDG_ICLLH;
            };
          };
          union {
            __IO uint16_t WDG_ICLH;
            struct {
              __IO uint8_t WDG_ICLHL;
              __IO uint8_t WDG_ICLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_RIS;
        stc_hwwdt_wdg_ris_field_t WDG_RIS_f;
        struct {
          union {
            __IO uint16_t WDG_RISL;
            struct {
              __IO uint8_t WDG_RISLL;
              __IO uint8_t WDG_RISLH;
            };
          };
          union {
            __IO uint16_t WDG_RISH;
            struct {
              __IO uint8_t WDG_RISHL;
              __IO uint8_t WDG_RISHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[3052];
    union {
        __IO uint32_t WDG_LCK;
        struct {
          union {
            __IO uint16_t WDG_LCKL;
            struct {
              __IO uint8_t WDG_LCKLL;
              __IO uint8_t WDG_LCKLH;
            };
          };
          union {
            __IO uint16_t WDG_LCKH;
            struct {
              __IO uint8_t WDG_LCKHL;
              __IO uint8_t WDG_LCKHH;
            };
          };
        };
    };
} FM_HWWDT_TypeDef, FM4_HWWDT_TypeDef;

/*******************************************************************************
* I2S_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t RXFDAT;
        stc_i2s_rxfdat_field_t RXFDAT_f;
        struct {
          union {
            __IO uint16_t RXFDATL;
            struct {
              __IO uint8_t RXFDATLL;
              __IO uint8_t RXFDATLH;
            };
          };
          union {
            __IO uint16_t RXFDATH;
            struct {
              __IO uint8_t RXFDATHL;
              __IO uint8_t RXFDATHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFDAT;
        stc_i2s_txfdat_field_t TXFDAT_f;
        struct {
          union {
            __IO uint16_t TXFDATL;
            struct {
              __IO uint8_t TXFDATLL;
              __IO uint8_t TXFDATLH;
            };
          };
          union {
            __IO uint16_t TXFDATH;
            struct {
              __IO uint8_t TXFDATHL;
              __IO uint8_t TXFDATHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CNTREG;
        stc_i2s_cntreg_field_t CNTREG_f;
        struct {
          union {
            __IO uint16_t CNTREGL;
            struct {
              __IO uint8_t CNTREGLL;
              __IO uint8_t CNTREGLH;
            };
          };
          union {
            __IO uint16_t CNTREGH;
            struct {
              __IO uint8_t CNTREGHL;
              __IO uint8_t CNTREGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MCR0REG;
        stc_i2s_mcr0reg_field_t MCR0REG_f;
        struct {
          union {
            __IO uint16_t MCR0REGL;
            struct {
              __IO uint8_t MCR0REGLL;
              __IO uint8_t MCR0REGLH;
            };
          };
          union {
            __IO uint16_t MCR0REGH;
            struct {
              __IO uint8_t MCR0REGHL;
              __IO uint8_t MCR0REGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MCR1REG;
        stc_i2s_mcr1reg_field_t MCR1REG_f;
        struct {
          union {
            __IO uint16_t MCR1REGL;
            struct {
              __IO uint8_t MCR1REGLL;
              __IO uint8_t MCR1REGLH;
            };
          };
          union {
            __IO uint16_t MCR1REGH;
            struct {
              __IO uint8_t MCR1REGHL;
              __IO uint8_t MCR1REGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MCR2REG;
        stc_i2s_mcr2reg_field_t MCR2REG_f;
        struct {
          union {
            __IO uint16_t MCR2REGL;
            struct {
              __IO uint8_t MCR2REGLL;
              __IO uint8_t MCR2REGLH;
            };
          };
          union {
            __IO uint16_t MCR2REGH;
            struct {
              __IO uint8_t MCR2REGHL;
              __IO uint8_t MCR2REGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t OPRREG;
        stc_i2s_oprreg_field_t OPRREG_f;
        struct {
          union {
            __IO uint16_t OPRREGL;
            struct {
              __IO uint8_t OPRREGLL;
              __IO uint8_t OPRREGLH;
            };
          };
          union {
            __IO uint16_t OPRREGH;
            struct {
              __IO uint8_t OPRREGHL;
              __IO uint8_t OPRREGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SRST;
        stc_i2s_srst_field_t SRST_f;
        struct {
          union {
            __IO uint16_t SRSTL;
            struct {
              __IO uint8_t SRSTLL;
              __IO uint8_t SRSTLH;
            };
          };
          union {
            __IO uint16_t SRSTH;
            struct {
              __IO uint8_t SRSTHL;
              __IO uint8_t SRSTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t INTCNT;
        stc_i2s_intcnt_field_t INTCNT_f;
        struct {
          union {
            __IO uint16_t INTCNTL;
            struct {
              __IO uint8_t INTCNTLL;
              __IO uint8_t INTCNTLH;
            };
          };
          union {
            __IO uint16_t INTCNTH;
            struct {
              __IO uint8_t INTCNTHL;
              __IO uint8_t INTCNTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STATUS;
        stc_i2s_status_field_t STATUS_f;
        struct {
          union {
            __IO uint16_t STATUSL;
            struct {
              __IO uint8_t STATUSLL;
              __IO uint8_t STATUSLH;
            };
          };
          union {
            __IO uint16_t STATUSH;
            struct {
              __IO uint8_t STATUSHL;
              __IO uint8_t STATUSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DMAACT;
        stc_i2s_dmaact_field_t DMAACT_f;
        struct {
          union {
            __IO uint16_t DMAACTL;
            struct {
              __IO uint8_t DMAACTLL;
              __IO uint8_t DMAACTLH;
            };
          };
          union {
            __IO uint16_t DMAACTH;
            struct {
              __IO uint8_t DMAACTHL;
              __IO uint8_t DMAACTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSTREG;
        stc_i2s_tstreg_field_t TSTREG_f;
        struct {
          union {
            __IO uint16_t TSTREGL;
            struct {
              __IO uint8_t TSTREGLL;
              __IO uint8_t TSTREGLH;
            };
          };
          union {
            __IO uint16_t TSTREGH;
            struct {
              __IO uint8_t TSTREGHL;
              __IO uint8_t TSTREGHH;
            };
          };
        };
    };
} FM_I2S_TypeDef, FM4_I2S_TypeDef;

