mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xl/common/s6e2c1xl.h
#define bFM_ADC2_ADSS01_TS0                       *((volatile  uint8_t *)(0x424E4580UL))
#define bFM4_ADC2_ADSS01_TS0                      *((volatile  uint8_t *)(0x424E4580UL))
#define bFM_ADC2_ADSS01_TS1                       *((volatile  uint8_t *)(0x424E4584UL))
#define bFM4_ADC2_ADSS01_TS1                      *((volatile  uint8_t *)(0x424E4584UL))
#define bFM_ADC2_ADSS01_TS2                       *((volatile  uint8_t *)(0x424E4588UL))
#define bFM4_ADC2_ADSS01_TS2                      *((volatile  uint8_t *)(0x424E4588UL))
#define bFM_ADC2_ADSS01_TS3                       *((volatile  uint8_t *)(0x424E458CUL))
#define bFM4_ADC2_ADSS01_TS3                      *((volatile  uint8_t *)(0x424E458CUL))
#define bFM_ADC2_ADSS01_TS4                       *((volatile  uint8_t *)(0x424E4590UL))
#define bFM4_ADC2_ADSS01_TS4                      *((volatile  uint8_t *)(0x424E4590UL))
#define bFM_ADC2_ADSS01_TS5                       *((volatile  uint8_t *)(0x424E4594UL))
#define bFM4_ADC2_ADSS01_TS5                      *((volatile  uint8_t *)(0x424E4594UL))
#define bFM_ADC2_ADSS01_TS6                       *((volatile  uint8_t *)(0x424E4598UL))
#define bFM4_ADC2_ADSS01_TS6                      *((volatile  uint8_t *)(0x424E4598UL))
#define bFM_ADC2_ADSS01_TS7                       *((volatile  uint8_t *)(0x424E459CUL))
#define bFM4_ADC2_ADSS01_TS7                      *((volatile  uint8_t *)(0x424E459CUL))
#define bFM_ADC2_ADSS01_TS8                       *((volatile  uint8_t *)(0x424E45A0UL))
#define bFM4_ADC2_ADSS01_TS8                      *((volatile  uint8_t *)(0x424E45A0UL))
#define bFM_ADC2_ADSS01_TS9                       *((volatile  uint8_t *)(0x424E45A4UL))
#define bFM4_ADC2_ADSS01_TS9                      *((volatile  uint8_t *)(0x424E45A4UL))
#define bFM_ADC2_ADSS01_TS10                      *((volatile  uint8_t *)(0x424E45A8UL))
#define bFM4_ADC2_ADSS01_TS10                     *((volatile  uint8_t *)(0x424E45A8UL))
#define bFM_ADC2_ADSS01_TS11                      *((volatile  uint8_t *)(0x424E45ACUL))
#define bFM4_ADC2_ADSS01_TS11                     *((volatile  uint8_t *)(0x424E45ACUL))
#define bFM_ADC2_ADSS01_TS12                      *((volatile  uint8_t *)(0x424E45B0UL))
#define bFM4_ADC2_ADSS01_TS12                     *((volatile  uint8_t *)(0x424E45B0UL))
#define bFM_ADC2_ADSS01_TS13                      *((volatile  uint8_t *)(0x424E45B4UL))
#define bFM4_ADC2_ADSS01_TS13                     *((volatile  uint8_t *)(0x424E45B4UL))
#define bFM_ADC2_ADSS01_TS14                      *((volatile  uint8_t *)(0x424E45B8UL))
#define bFM4_ADC2_ADSS01_TS14                     *((volatile  uint8_t *)(0x424E45B8UL))
#define bFM_ADC2_ADSS01_TS15                      *((volatile  uint8_t *)(0x424E45BCUL))
#define bFM4_ADC2_ADSS01_TS15                     *((volatile  uint8_t *)(0x424E45BCUL))

#define bFM_ADC2_ADSS23_TS16                      *((volatile  uint8_t *)(0x424E4500UL))
#define bFM4_ADC2_ADSS23_TS16                     *((volatile  uint8_t *)(0x424E4500UL))
#define bFM_ADC2_ADSS23_TS17                      *((volatile  uint8_t *)(0x424E4504UL))
#define bFM4_ADC2_ADSS23_TS17                     *((volatile  uint8_t *)(0x424E4504UL))
#define bFM_ADC2_ADSS23_TS18                      *((volatile  uint8_t *)(0x424E4508UL))
#define bFM4_ADC2_ADSS23_TS18                     *((volatile  uint8_t *)(0x424E4508UL))
#define bFM_ADC2_ADSS23_TS19                      *((volatile  uint8_t *)(0x424E450CUL))
#define bFM4_ADC2_ADSS23_TS19                     *((volatile  uint8_t *)(0x424E450CUL))
#define bFM_ADC2_ADSS23_TS20                      *((volatile  uint8_t *)(0x424E4510UL))
#define bFM4_ADC2_ADSS23_TS20                     *((volatile  uint8_t *)(0x424E4510UL))
#define bFM_ADC2_ADSS23_TS21                      *((volatile  uint8_t *)(0x424E4514UL))
#define bFM4_ADC2_ADSS23_TS21                     *((volatile  uint8_t *)(0x424E4514UL))
#define bFM_ADC2_ADSS23_TS22                      *((volatile  uint8_t *)(0x424E4518UL))
#define bFM4_ADC2_ADSS23_TS22                     *((volatile  uint8_t *)(0x424E4518UL))
#define bFM_ADC2_ADSS23_TS23                      *((volatile  uint8_t *)(0x424E451CUL))
#define bFM4_ADC2_ADSS23_TS23                     *((volatile  uint8_t *)(0x424E451CUL))
#define bFM_ADC2_ADSS23_TS24                      *((volatile  uint8_t *)(0x424E4520UL))
#define bFM4_ADC2_ADSS23_TS24                     *((volatile  uint8_t *)(0x424E4520UL))
#define bFM_ADC2_ADSS23_TS25                      *((volatile  uint8_t *)(0x424E4524UL))
#define bFM4_ADC2_ADSS23_TS25                     *((volatile  uint8_t *)(0x424E4524UL))
#define bFM_ADC2_ADSS23_TS26                      *((volatile  uint8_t *)(0x424E4528UL))
#define bFM4_ADC2_ADSS23_TS26                     *((volatile  uint8_t *)(0x424E4528UL))
#define bFM_ADC2_ADSS23_TS27                      *((volatile  uint8_t *)(0x424E452CUL))
#define bFM4_ADC2_ADSS23_TS27                     *((volatile  uint8_t *)(0x424E452CUL))
#define bFM_ADC2_ADSS23_TS28                      *((volatile  uint8_t *)(0x424E4530UL))
#define bFM4_ADC2_ADSS23_TS28                     *((volatile  uint8_t *)(0x424E4530UL))
#define bFM_ADC2_ADSS23_TS29                      *((volatile  uint8_t *)(0x424E4534UL))
#define bFM4_ADC2_ADSS23_TS29                     *((volatile  uint8_t *)(0x424E4534UL))
#define bFM_ADC2_ADSS23_TS30                      *((volatile  uint8_t *)(0x424E4538UL))
#define bFM4_ADC2_ADSS23_TS30                     *((volatile  uint8_t *)(0x424E4538UL))
#define bFM_ADC2_ADSS23_TS31                      *((volatile  uint8_t *)(0x424E453CUL))
#define bFM4_ADC2_ADSS23_TS31                     *((volatile  uint8_t *)(0x424E453CUL))

#define bFM_ADC2_CALSR_CLBEN                      *((volatile  uint8_t *)(0x424E4820UL))
#define bFM4_ADC2_CALSR_CLBEN                     *((volatile  uint8_t *)(0x424E4820UL))

#define bFM_ADC2_CMPCR_CMD0                       *((volatile  uint8_t *)(0x424E4494UL))
#define bFM4_ADC2_CMPCR_CMD0                      *((volatile  uint8_t *)(0x424E4494UL))
#define bFM_ADC2_CMPCR_CMD1                       *((volatile  uint8_t *)(0x424E4498UL))
#define bFM4_ADC2_CMPCR_CMD1                      *((volatile  uint8_t *)(0x424E4498UL))
#define bFM_ADC2_CMPCR_CMPEN                      *((volatile  uint8_t *)(0x424E449CUL))
#define bFM4_ADC2_CMPCR_CMPEN                     *((volatile  uint8_t *)(0x424E449CUL))

#define bFM_ADC2_PCCR_PSTR                        *((volatile  uint8_t *)(0x424E4320UL))
#define bFM4_ADC2_PCCR_PSTR                       *((volatile  uint8_t *)(0x424E4320UL))
#define bFM_ADC2_PCCR_PHEN                        *((volatile  uint8_t *)(0x424E4324UL))
#define bFM4_ADC2_PCCR_PHEN                       *((volatile  uint8_t *)(0x424E4324UL))
#define bFM_ADC2_PCCR_PEEN                        *((volatile  uint8_t *)(0x424E4328UL))
#define bFM4_ADC2_PCCR_PEEN                       *((volatile  uint8_t *)(0x424E4328UL))
#define bFM_ADC2_PCCR_ESCE                        *((volatile  uint8_t *)(0x424E432CUL))
#define bFM4_ADC2_PCCR_ESCE                       *((volatile  uint8_t *)(0x424E432CUL))
#define bFM_ADC2_PCCR_PFCLR                       *((volatile  uint8_t *)(0x424E4330UL))
#define bFM4_ADC2_PCCR_PFCLR                      *((volatile  uint8_t *)(0x424E4330UL))
#define bFM_ADC2_PCCR_POVR                        *((volatile  uint8_t *)(0x424E4334UL))
#define bFM4_ADC2_PCCR_POVR                       *((volatile  uint8_t *)(0x424E4334UL))
#define bFM_ADC2_PCCR_PFUL                        *((volatile  uint8_t *)(0x424E4338UL))
#define bFM4_ADC2_PCCR_PFUL                       *((volatile  uint8_t *)(0x424E4338UL))
#define bFM_ADC2_PCCR_PEMP                        *((volatile  uint8_t *)(0x424E433CUL))
#define bFM4_ADC2_PCCR_PEMP                       *((volatile  uint8_t *)(0x424E433CUL))

#define bFM_ADC2_PCFD_INVL                        *((volatile  uint8_t *)(0x424E43B0UL))
#define bFM4_ADC2_PCFD_INVL                       *((volatile  uint8_t *)(0x424E43B0UL))

#define bFM_ADC2_PCFD_FDAS1_INVL                  *((volatile  uint8_t *)(0x424E43B0UL))
#define bFM4_ADC2_PCFD_FDAS1_INVL                 *((volatile  uint8_t *)(0x424E43B0UL))

#define bFM_ADC2_SCCR_SSTR                        *((volatile  uint8_t *)(0x424E4120UL))
#define bFM4_ADC2_SCCR_SSTR                       *((volatile  uint8_t *)(0x424E4120UL))
#define bFM_ADC2_SCCR_SHEN                        *((volatile  uint8_t *)(0x424E4124UL))
#define bFM4_ADC2_SCCR_SHEN                       *((volatile  uint8_t *)(0x424E4124UL))
#define bFM_ADC2_SCCR_RPT                         *((volatile  uint8_t *)(0x424E4128UL))
#define bFM4_ADC2_SCCR_RPT                        *((volatile  uint8_t *)(0x424E4128UL))
#define bFM_ADC2_SCCR_SFCLR                       *((volatile  uint8_t *)(0x424E4130UL))
#define bFM4_ADC2_SCCR_SFCLR                      *((volatile  uint8_t *)(0x424E4130UL))
#define bFM_ADC2_SCCR_SOVR                        *((volatile  uint8_t *)(0x424E4134UL))
#define bFM4_ADC2_SCCR_SOVR                       *((volatile  uint8_t *)(0x424E4134UL))
#define bFM_ADC2_SCCR_SFUL                        *((volatile  uint8_t *)(0x424E4138UL))
#define bFM4_ADC2_SCCR_SFUL                       *((volatile  uint8_t *)(0x424E4138UL))
#define bFM_ADC2_SCCR_SEMP                        *((volatile  uint8_t *)(0x424E413CUL))
#define bFM4_ADC2_SCCR_SEMP                       *((volatile  uint8_t *)(0x424E413CUL))

#define bFM_ADC2_SCFD_INVL                        *((volatile  uint8_t *)(0x424E41B0UL))
#define bFM4_ADC2_SCFD_INVL                       *((volatile  uint8_t *)(0x424E41B0UL))

#define bFM_ADC2_SCFD_FDAS1_INVL                  *((volatile  uint8_t *)(0x424E41B0UL))
#define bFM4_ADC2_SCFD_FDAS1_INVL                 *((volatile  uint8_t *)(0x424E41B0UL))

#define bFM_ADC2_SCIS01_AN0                       *((volatile  uint8_t *)(0x424E4280UL))
#define bFM4_ADC2_SCIS01_AN0                      *((volatile  uint8_t *)(0x424E4280UL))
#define bFM_ADC2_SCIS01_AN1                       *((volatile  uint8_t *)(0x424E4284UL))
#define bFM4_ADC2_SCIS01_AN1                      *((volatile  uint8_t *)(0x424E4284UL))
#define bFM_ADC2_SCIS01_AN2                       *((volatile  uint8_t *)(0x424E4288UL))
#define bFM4_ADC2_SCIS01_AN2                      *((volatile  uint8_t *)(0x424E4288UL))
#define bFM_ADC2_SCIS01_AN3                       *((volatile  uint8_t *)(0x424E428CUL))
#define bFM4_ADC2_SCIS01_AN3                      *((volatile  uint8_t *)(0x424E428CUL))
#define bFM_ADC2_SCIS01_AN4                       *((volatile  uint8_t *)(0x424E4290UL))
#define bFM4_ADC2_SCIS01_AN4                      *((volatile  uint8_t *)(0x424E4290UL))
#define bFM_ADC2_SCIS01_AN5                       *((volatile  uint8_t *)(0x424E4294UL))
#define bFM4_ADC2_SCIS01_AN5                      *((volatile  uint8_t *)(0x424E4294UL))
#define bFM_ADC2_SCIS01_AN6                       *((volatile  uint8_t *)(0x424E4298UL))
#define bFM4_ADC2_SCIS01_AN6                      *((volatile  uint8_t *)(0x424E4298UL))
#define bFM_ADC2_SCIS01_AN7                       *((volatile  uint8_t *)(0x424E429CUL))
#define bFM4_ADC2_SCIS01_AN7                      *((volatile  uint8_t *)(0x424E429CUL))
#define bFM_ADC2_SCIS01_AN8                       *((volatile  uint8_t *)(0x424E42A0UL))
#define bFM4_ADC2_SCIS01_AN8                      *((volatile  uint8_t *)(0x424E42A0UL))
#define bFM_ADC2_SCIS01_AN9                       *((volatile  uint8_t *)(0x424E42A4UL))
#define bFM4_ADC2_SCIS01_AN9                      *((volatile  uint8_t *)(0x424E42A4UL))
#define bFM_ADC2_SCIS01_AN10                      *((volatile  uint8_t *)(0x424E42A8UL))
#define bFM4_ADC2_SCIS01_AN10                     *((volatile  uint8_t *)(0x424E42A8UL))
#define bFM_ADC2_SCIS01_AN11                      *((volatile  uint8_t *)(0x424E42ACUL))
#define bFM4_ADC2_SCIS01_AN11                     *((volatile  uint8_t *)(0x424E42ACUL))
#define bFM_ADC2_SCIS01_AN12                      *((volatile  uint8_t *)(0x424E42B0UL))
#define bFM4_ADC2_SCIS01_AN12                     *((volatile  uint8_t *)(0x424E42B0UL))
#define bFM_ADC2_SCIS01_AN13                      *((volatile  uint8_t *)(0x424E42B4UL))
#define bFM4_ADC2_SCIS01_AN13                     *((volatile  uint8_t *)(0x424E42B4UL))
#define bFM_ADC2_SCIS01_AN14                      *((volatile  uint8_t *)(0x424E42B8UL))
#define bFM4_ADC2_SCIS01_AN14                     *((volatile  uint8_t *)(0x424E42B8UL))
#define bFM_ADC2_SCIS01_AN15                      *((volatile  uint8_t *)(0x424E42BCUL))
#define bFM4_ADC2_SCIS01_AN15                     *((volatile  uint8_t *)(0x424E42BCUL))

