mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xl/common/s6e2c1xl.h
#define bFM_BT10_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9184UL))
#define bFM4_BT10_PWC_TMCR_CTEN                   *((volatile  uint8_t *)(0x424A9184UL))
#define bFM_BT10_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9188UL))
#define bFM4_BT10_PWC_TMCR_MDSE                   *((volatile  uint8_t *)(0x424A9188UL))
#define bFM_BT10_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424A919CUL))
#define bFM4_BT10_PWC_TMCR_T32                    *((volatile  uint8_t *)(0x424A919CUL))

#define bFM_BT10_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9220UL))
#define bFM4_BT10_PWC_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424A9220UL))

#define bFM_BT10_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424A9200UL))
#define bFM4_BT10_PWM_STC_UDIR                    *((volatile  uint8_t *)(0x424A9200UL))
#define bFM_BT10_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424A9204UL))
#define bFM4_BT10_PWM_STC_DTIR                    *((volatile  uint8_t *)(0x424A9204UL))
#define bFM_BT10_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424A9208UL))
#define bFM4_BT10_PWM_STC_TGIR                    *((volatile  uint8_t *)(0x424A9208UL))
#define bFM_BT10_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424A9210UL))
#define bFM4_BT10_PWM_STC_UDIE                    *((volatile  uint8_t *)(0x424A9210UL))
#define bFM_BT10_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424A9214UL))
#define bFM4_BT10_PWM_STC_DTIE                    *((volatile  uint8_t *)(0x424A9214UL))
#define bFM_BT10_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424A9218UL))
#define bFM4_BT10_PWM_STC_TGIE                    *((volatile  uint8_t *)(0x424A9218UL))

#define bFM_BT10_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424A9180UL))
#define bFM4_BT10_PWM_TMCR_STRG                   *((volatile  uint8_t *)(0x424A9180UL))
#define bFM_BT10_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9184UL))
#define bFM4_BT10_PWM_TMCR_CTEN                   *((volatile  uint8_t *)(0x424A9184UL))
#define bFM_BT10_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9188UL))
#define bFM4_BT10_PWM_TMCR_MDSE                   *((volatile  uint8_t *)(0x424A9188UL))
#define bFM_BT10_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A918CUL))
#define bFM4_BT10_PWM_TMCR_OSEL                   *((volatile  uint8_t *)(0x424A918CUL))
#define bFM_BT10_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A91A8UL))
#define bFM4_BT10_PWM_TMCR_PMSK                   *((volatile  uint8_t *)(0x424A91A8UL))
#define bFM_BT10_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A91ACUL))
#define bFM4_BT10_PWM_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424A91ACUL))

#define bFM_BT10_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9220UL))
#define bFM4_BT10_PWM_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424A9220UL))

#define bFM_BT10_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424A9200UL))
#define bFM4_BT10_RT_STC_UDIR                     *((volatile  uint8_t *)(0x424A9200UL))
#define bFM_BT10_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424A9208UL))
#define bFM4_BT10_RT_STC_TGIR                     *((volatile  uint8_t *)(0x424A9208UL))
#define bFM_BT10_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424A9210UL))
#define bFM4_BT10_RT_STC_UDIE                     *((volatile  uint8_t *)(0x424A9210UL))
#define bFM_BT10_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424A9218UL))
#define bFM4_BT10_RT_STC_TGIE                     *((volatile  uint8_t *)(0x424A9218UL))

#define bFM_BT10_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424A9180UL))
#define bFM4_BT10_RT_TMCR_STRG                    *((volatile  uint8_t *)(0x424A9180UL))
#define bFM_BT10_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A9184UL))
#define bFM4_BT10_RT_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9184UL))
#define bFM_BT10_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A9188UL))
#define bFM4_BT10_RT_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9188UL))
#define bFM_BT10_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A918CUL))
#define bFM4_BT10_RT_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A918CUL))
#define bFM_BT10_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424A919CUL))
#define bFM4_BT10_RT_TMCR_T32                     *((volatile  uint8_t *)(0x424A919CUL))

#define bFM_BT10_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A9220UL))
#define bFM4_BT10_RT_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9220UL))
#define bFM_BT10_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424A923CUL))
#define bFM4_BT10_RT_TMCR2_GATE                   *((volatile  uint8_t *)(0x424A923CUL))


/*******************************************************************************
* BT Registers BT11
*   Bitband Section
*******************************************************************************/
#define bFM_BT11_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM4_BT11_PPG_STC_UDIR                    *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM_BT11_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM4_BT11_PPG_STC_TGIR                    *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM_BT11_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM4_BT11_PPG_STC_UDIE                    *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM_BT11_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424A9A18UL))
#define bFM4_BT11_PPG_STC_TGIE                    *((volatile  uint8_t *)(0x424A9A18UL))

#define bFM_BT11_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424A9980UL))
#define bFM4_BT11_PPG_TMCR_STRG                   *((volatile  uint8_t *)(0x424A9980UL))
#define bFM_BT11_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9984UL))
#define bFM4_BT11_PPG_TMCR_CTEN                   *((volatile  uint8_t *)(0x424A9984UL))
#define bFM_BT11_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9988UL))
#define bFM4_BT11_PPG_TMCR_MDSE                   *((volatile  uint8_t *)(0x424A9988UL))
#define bFM_BT11_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A998CUL))
#define bFM4_BT11_PPG_TMCR_OSEL                   *((volatile  uint8_t *)(0x424A998CUL))
#define bFM_BT11_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A99A8UL))
#define bFM4_BT11_PPG_TMCR_PMSK                   *((volatile  uint8_t *)(0x424A99A8UL))
#define bFM_BT11_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A99ACUL))
#define bFM4_BT11_PPG_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424A99ACUL))

#define bFM_BT11_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9A20UL))
#define bFM4_BT11_PPG_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424A9A20UL))

#define bFM_BT11_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM4_BT11_PWC_STC_OVIR                    *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM_BT11_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM4_BT11_PWC_STC_EDIR                    *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM_BT11_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM4_BT11_PWC_STC_OVIE                    *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM_BT11_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424A9A18UL))
#define bFM4_BT11_PWC_STC_EDIE                    *((volatile  uint8_t *)(0x424A9A18UL))
#define bFM_BT11_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424A9A1CUL))
#define bFM4_BT11_PWC_STC_ERR                     *((volatile  uint8_t *)(0x424A9A1CUL))

#define bFM_BT11_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9984UL))
#define bFM4_BT11_PWC_TMCR_CTEN                   *((volatile  uint8_t *)(0x424A9984UL))
#define bFM_BT11_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9988UL))
#define bFM4_BT11_PWC_TMCR_MDSE                   *((volatile  uint8_t *)(0x424A9988UL))
#define bFM_BT11_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424A999CUL))
#define bFM4_BT11_PWC_TMCR_T32                    *((volatile  uint8_t *)(0x424A999CUL))

