mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xl/common/s6e2c1xl.h
#define bFM_GPIO_PDOR7_P0                         *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P0                        *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM_GPIO_PDOR7_P1                         *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P1                        *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM_GPIO_PDOR7_P2                         *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P2                        *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM_GPIO_PDOR7_P3                         *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P3                        *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM_GPIO_PDOR7_P4                         *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM4_GPIO_PDOR7_P4                        *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM_GPIO_PDOR7_P5                         *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM4_GPIO_PDOR7_P5                        *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM_GPIO_PDOR7_P6                         *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM4_GPIO_PDOR7_P6                        *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM_GPIO_PDOR7_P7                         *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM4_GPIO_PDOR7_P7                        *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM_GPIO_PDOR7_P8                         *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM4_GPIO_PDOR7_P8                        *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM_GPIO_PDOR7_P9                         *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM4_GPIO_PDOR7_P9                        *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM_GPIO_PDOR7_PA                         *((volatile  uint8_t *)(0x42DE83A8UL))
#define bFM4_GPIO_PDOR7_PA                        *((volatile  uint8_t *)(0x42DE83A8UL))
#define bFM_GPIO_PDOR7_PB                         *((volatile  uint8_t *)(0x42DE83ACUL))
#define bFM4_GPIO_PDOR7_PB                        *((volatile  uint8_t *)(0x42DE83ACUL))
#define bFM_GPIO_PDOR7_PC                         *((volatile  uint8_t *)(0x42DE83B0UL))
#define bFM4_GPIO_PDOR7_PC                        *((volatile  uint8_t *)(0x42DE83B0UL))
#define bFM_GPIO_PDOR7_PD                         *((volatile  uint8_t *)(0x42DE83B4UL))
#define bFM4_GPIO_PDOR7_PD                        *((volatile  uint8_t *)(0x42DE83B4UL))
#define bFM_GPIO_PDOR7_PE                         *((volatile  uint8_t *)(0x42DE83B8UL))
#define bFM4_GPIO_PDOR7_PE                        *((volatile  uint8_t *)(0x42DE83B8UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM_GPIO_PDOR8_P2                         *((volatile  uint8_t *)(0x42DE8408UL))
#define bFM4_GPIO_PDOR8_P2                        *((volatile  uint8_t *)(0x42DE8408UL))
#define bFM_GPIO_PDOR8_P3                         *((volatile  uint8_t *)(0x42DE840CUL))
#define bFM4_GPIO_PDOR8_P3                        *((volatile  uint8_t *)(0x42DE840CUL))

#define bFM_GPIO_PDOR9_P0                         *((volatile  uint8_t *)(0x42DE8480UL))
#define bFM4_GPIO_PDOR9_P0                        *((volatile  uint8_t *)(0x42DE8480UL))
#define bFM_GPIO_PDOR9_P1                         *((volatile  uint8_t *)(0x42DE8484UL))
#define bFM4_GPIO_PDOR9_P1                        *((volatile  uint8_t *)(0x42DE8484UL))
#define bFM_GPIO_PDOR9_P2                         *((volatile  uint8_t *)(0x42DE8488UL))
#define bFM4_GPIO_PDOR9_P2                        *((volatile  uint8_t *)(0x42DE8488UL))
#define bFM_GPIO_PDOR9_P3                         *((volatile  uint8_t *)(0x42DE848CUL))
#define bFM4_GPIO_PDOR9_P3                        *((volatile  uint8_t *)(0x42DE848CUL))
#define bFM_GPIO_PDOR9_P4                         *((volatile  uint8_t *)(0x42DE8490UL))
#define bFM4_GPIO_PDOR9_P4                        *((volatile  uint8_t *)(0x42DE8490UL))
#define bFM_GPIO_PDOR9_P5                         *((volatile  uint8_t *)(0x42DE8494UL))
#define bFM4_GPIO_PDOR9_P5                        *((volatile  uint8_t *)(0x42DE8494UL))
#define bFM_GPIO_PDOR9_P6                         *((volatile  uint8_t *)(0x42DE8498UL))
#define bFM4_GPIO_PDOR9_P6                        *((volatile  uint8_t *)(0x42DE8498UL))
#define bFM_GPIO_PDOR9_P7                         *((volatile  uint8_t *)(0x42DE849CUL))
#define bFM4_GPIO_PDOR9_P7                        *((volatile  uint8_t *)(0x42DE849CUL))

#define bFM_GPIO_PDORA_P0                         *((volatile  uint8_t *)(0x42DE8500UL))
#define bFM4_GPIO_PDORA_P0                        *((volatile  uint8_t *)(0x42DE8500UL))
#define bFM_GPIO_PDORA_P1                         *((volatile  uint8_t *)(0x42DE8504UL))
#define bFM4_GPIO_PDORA_P1                        *((volatile  uint8_t *)(0x42DE8504UL))
#define bFM_GPIO_PDORA_P2                         *((volatile  uint8_t *)(0x42DE8508UL))
#define bFM4_GPIO_PDORA_P2                        *((volatile  uint8_t *)(0x42DE8508UL))
#define bFM_GPIO_PDORA_P3                         *((volatile  uint8_t *)(0x42DE850CUL))
#define bFM4_GPIO_PDORA_P3                        *((volatile  uint8_t *)(0x42DE850CUL))
#define bFM_GPIO_PDORA_P4                         *((volatile  uint8_t *)(0x42DE8510UL))
#define bFM4_GPIO_PDORA_P4                        *((volatile  uint8_t *)(0x42DE8510UL))
#define bFM_GPIO_PDORA_P5                         *((volatile  uint8_t *)(0x42DE8514UL))
#define bFM4_GPIO_PDORA_P5                        *((volatile  uint8_t *)(0x42DE8514UL))
#define bFM_GPIO_PDORA_P6                         *((volatile  uint8_t *)(0x42DE8518UL))
#define bFM4_GPIO_PDORA_P6                        *((volatile  uint8_t *)(0x42DE8518UL))
#define bFM_GPIO_PDORA_P7                         *((volatile  uint8_t *)(0x42DE851CUL))
#define bFM4_GPIO_PDORA_P7                        *((volatile  uint8_t *)(0x42DE851CUL))
#define bFM_GPIO_PDORA_P8                         *((volatile  uint8_t *)(0x42DE8520UL))
#define bFM4_GPIO_PDORA_P8                        *((volatile  uint8_t *)(0x42DE8520UL))
#define bFM_GPIO_PDORA_P9                         *((volatile  uint8_t *)(0x42DE8524UL))
#define bFM4_GPIO_PDORA_P9                        *((volatile  uint8_t *)(0x42DE8524UL))
#define bFM_GPIO_PDORA_PA                         *((volatile  uint8_t *)(0x42DE8528UL))
#define bFM4_GPIO_PDORA_PA                        *((volatile  uint8_t *)(0x42DE8528UL))
#define bFM_GPIO_PDORA_PB                         *((volatile  uint8_t *)(0x42DE852CUL))
#define bFM4_GPIO_PDORA_PB                        *((volatile  uint8_t *)(0x42DE852CUL))
#define bFM_GPIO_PDORA_PC                         *((volatile  uint8_t *)(0x42DE8530UL))
#define bFM4_GPIO_PDORA_PC                        *((volatile  uint8_t *)(0x42DE8530UL))
#define bFM_GPIO_PDORA_PD                         *((volatile  uint8_t *)(0x42DE8534UL))
#define bFM4_GPIO_PDORA_PD                        *((volatile  uint8_t *)(0x42DE8534UL))
#define bFM_GPIO_PDORA_PE                         *((volatile  uint8_t *)(0x42DE8538UL))
#define bFM4_GPIO_PDORA_PE                        *((volatile  uint8_t *)(0x42DE8538UL))
#define bFM_GPIO_PDORA_PF                         *((volatile  uint8_t *)(0x42DE853CUL))
#define bFM4_GPIO_PDORA_PF                        *((volatile  uint8_t *)(0x42DE853CUL))

