mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xl/common/s6e2c1xl.h
/*******************************************************************************
* MFS Registers MFS14
*   Bitband Section
*******************************************************************************/
#define bFM_MFS14_CSIO_ESCR_CSFE                  *((volatile  uint8_t *)(0x4271C094UL))
#define bFM4_MFS14_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x4271C094UL))
#define bFM_MFS14_CSIO_ESCR_L3                    *((volatile  uint8_t *)(0x4271C098UL))
#define bFM4_MFS14_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x4271C098UL))
#define bFM_MFS14_CSIO_ESCR_SOP                   *((volatile  uint8_t *)(0x4271C09CUL))
#define bFM4_MFS14_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4271C09CUL))

#define bFM_MFS14_CSIO_FCR_FE1                    *((volatile  uint8_t *)(0x4271C280UL))
#define bFM4_MFS14_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x4271C280UL))
#define bFM_MFS14_CSIO_FCR_FE2                    *((volatile  uint8_t *)(0x4271C284UL))
#define bFM4_MFS14_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x4271C284UL))
#define bFM_MFS14_CSIO_FCR_FCL1                   *((volatile  uint8_t *)(0x4271C288UL))
#define bFM4_MFS14_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x4271C288UL))
#define bFM_MFS14_CSIO_FCR_FCL2                   *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM4_MFS14_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM_MFS14_CSIO_FCR_FSET                   *((volatile  uint8_t *)(0x4271C290UL))
#define bFM4_MFS14_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x4271C290UL))
#define bFM_MFS14_CSIO_FCR_FLD                    *((volatile  uint8_t *)(0x4271C294UL))
#define bFM4_MFS14_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x4271C294UL))
#define bFM_MFS14_CSIO_FCR_FLST                   *((volatile  uint8_t *)(0x4271C298UL))
#define bFM4_MFS14_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x4271C298UL))
#define bFM_MFS14_CSIO_FCR_FSEL                   *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM4_MFS14_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM_MFS14_CSIO_FCR_FTIE                   *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM4_MFS14_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM_MFS14_CSIO_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM4_MFS14_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM_MFS14_CSIO_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM4_MFS14_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM_MFS14_CSIO_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271C2B0UL))
#define bFM4_MFS14_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x4271C2B0UL))

#define bFM_MFS14_CSIO_SACSR_TMRE                 *((volatile  uint8_t *)(0x4271C480UL))
#define bFM4_MFS14_CSIO_SACSR_TMRE                *((volatile  uint8_t *)(0x4271C480UL))
#define bFM_MFS14_CSIO_SACSR_TSYNE                *((volatile  uint8_t *)(0x4271C498UL))
#define bFM4_MFS14_CSIO_SACSR_TSYNE               *((volatile  uint8_t *)(0x4271C498UL))
#define bFM_MFS14_CSIO_SACSR_TINTE                *((volatile  uint8_t *)(0x4271C49CUL))
#define bFM4_MFS14_CSIO_SACSR_TINTE               *((volatile  uint8_t *)(0x4271C49CUL))
#define bFM_MFS14_CSIO_SACSR_TINT                 *((volatile  uint8_t *)(0x4271C4A0UL))
#define bFM4_MFS14_CSIO_SACSR_TINT                *((volatile  uint8_t *)(0x4271C4A0UL))
#define bFM_MFS14_CSIO_SACSR_CSE                  *((volatile  uint8_t *)(0x4271C4ACUL))
#define bFM4_MFS14_CSIO_SACSR_CSE                 *((volatile  uint8_t *)(0x4271C4ACUL))
#define bFM_MFS14_CSIO_SACSR_CSEIE                *((volatile  uint8_t *)(0x4271C4B0UL))
#define bFM4_MFS14_CSIO_SACSR_CSEIE               *((volatile  uint8_t *)(0x4271C4B0UL))
#define bFM_MFS14_CSIO_SACSR_TBEEN                *((volatile  uint8_t *)(0x4271C4B4UL))
#define bFM4_MFS14_CSIO_SACSR_TBEEN               *((volatile  uint8_t *)(0x4271C4B4UL))

#define bFM_MFS14_CSIO_SCR_TXE                    *((volatile  uint8_t *)(0x4271C020UL))
#define bFM4_MFS14_CSIO_SCR_TXE                   *((volatile  uint8_t *)(0x4271C020UL))
#define bFM_MFS14_CSIO_SCR_RXE                    *((volatile  uint8_t *)(0x4271C024UL))
#define bFM4_MFS14_CSIO_SCR_RXE                   *((volatile  uint8_t *)(0x4271C024UL))
#define bFM_MFS14_CSIO_SCR_TBIE                   *((volatile  uint8_t *)(0x4271C028UL))
#define bFM4_MFS14_CSIO_SCR_TBIE                  *((volatile  uint8_t *)(0x4271C028UL))
#define bFM_MFS14_CSIO_SCR_TIE                    *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM4_MFS14_CSIO_SCR_TIE                   *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM_MFS14_CSIO_SCR_RIE                    *((volatile  uint8_t *)(0x4271C030UL))
#define bFM4_MFS14_CSIO_SCR_RIE                   *((volatile  uint8_t *)(0x4271C030UL))
#define bFM_MFS14_CSIO_SCR_SPI                    *((volatile  uint8_t *)(0x4271C034UL))
#define bFM4_MFS14_CSIO_SCR_SPI                   *((volatile  uint8_t *)(0x4271C034UL))
#define bFM_MFS14_CSIO_SCR_MS                     *((volatile  uint8_t *)(0x4271C038UL))
#define bFM4_MFS14_CSIO_SCR_MS                    *((volatile  uint8_t *)(0x4271C038UL))
#define bFM_MFS14_CSIO_SCR_UPCL                   *((volatile  uint8_t *)(0x4271C03CUL))
#define bFM4_MFS14_CSIO_SCR_UPCL                  *((volatile  uint8_t *)(0x4271C03CUL))

#define bFM_MFS14_CSIO_SCSCR_CSOE                 *((volatile  uint8_t *)(0x4271C600UL))
#define bFM4_MFS14_CSIO_SCSCR_CSOE                *((volatile  uint8_t *)(0x4271C600UL))
#define bFM_MFS14_CSIO_SCSCR_CSEN0                *((volatile  uint8_t *)(0x4271C604UL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN0               *((volatile  uint8_t *)(0x4271C604UL))
#define bFM_MFS14_CSIO_SCSCR_CSEN1                *((volatile  uint8_t *)(0x4271C608UL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN1               *((volatile  uint8_t *)(0x4271C608UL))
#define bFM_MFS14_CSIO_SCSCR_CSEN2                *((volatile  uint8_t *)(0x4271C60CUL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN2               *((volatile  uint8_t *)(0x4271C60CUL))
#define bFM_MFS14_CSIO_SCSCR_CSEN3                *((volatile  uint8_t *)(0x4271C610UL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN3               *((volatile  uint8_t *)(0x4271C610UL))
#define bFM_MFS14_CSIO_SCSCR_CSLVL                *((volatile  uint8_t *)(0x4271C614UL))
#define bFM4_MFS14_CSIO_SCSCR_CSLVL               *((volatile  uint8_t *)(0x4271C614UL))
#define bFM_MFS14_CSIO_SCSCR_SCAM                 *((volatile  uint8_t *)(0x4271C624UL))
#define bFM4_MFS14_CSIO_SCSCR_SCAM                *((volatile  uint8_t *)(0x4271C624UL))

#define bFM_MFS14_CSIO_SCSFR0_CS1SPI              *((volatile  uint8_t *)(0x4271C694UL))
#define bFM4_MFS14_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x4271C694UL))
#define bFM_MFS14_CSIO_SCSFR0_CS1SCINV            *((volatile  uint8_t *)(0x4271C698UL))
#define bFM4_MFS14_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x4271C698UL))
#define bFM_MFS14_CSIO_SCSFR0_CS1CSLVL            *((volatile  uint8_t *)(0x4271C69CUL))
#define bFM4_MFS14_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4271C69CUL))

#define bFM_MFS14_CSIO_SCSFR1_CS2SPI              *((volatile  uint8_t *)(0x4271C6B4UL))
#define bFM4_MFS14_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x4271C6B4UL))
#define bFM_MFS14_CSIO_SCSFR1_CS2SCINV            *((volatile  uint8_t *)(0x4271C6B8UL))
#define bFM4_MFS14_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x4271C6B8UL))
#define bFM_MFS14_CSIO_SCSFR1_CS2CSLVL            *((volatile  uint8_t *)(0x4271C6BCUL))
#define bFM4_MFS14_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x4271C6BCUL))

#define bFM_MFS14_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x4271C714UL))
#define bFM4_MFS14_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x4271C714UL))
#define bFM_MFS14_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x4271C718UL))
#define bFM4_MFS14_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x4271C718UL))
#define bFM_MFS14_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271C71CUL))
#define bFM4_MFS14_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4271C71CUL))

