mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xl/common/s6e2c1xl.h
#define bFM_MFS14_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x4271C090UL))
#define bFM4_MFS14_LIN_ESCR_LBIE                  *((volatile  uint8_t *)(0x4271C090UL))
#define bFM_MFS14_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x4271C098UL))
#define bFM4_MFS14_LIN_ESCR_ESBL                  *((volatile  uint8_t *)(0x4271C098UL))

#define bFM_MFS14_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x4271C280UL))
#define bFM4_MFS14_LIN_FCR_FE1                    *((volatile  uint8_t *)(0x4271C280UL))
#define bFM_MFS14_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x4271C284UL))
#define bFM4_MFS14_LIN_FCR_FE2                    *((volatile  uint8_t *)(0x4271C284UL))
#define bFM_MFS14_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x4271C288UL))
#define bFM4_MFS14_LIN_FCR_FCL1                   *((volatile  uint8_t *)(0x4271C288UL))
#define bFM_MFS14_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM4_MFS14_LIN_FCR_FCL2                   *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM_MFS14_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x4271C290UL))
#define bFM4_MFS14_LIN_FCR_FSET                   *((volatile  uint8_t *)(0x4271C290UL))
#define bFM_MFS14_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x4271C294UL))
#define bFM4_MFS14_LIN_FCR_FLD                    *((volatile  uint8_t *)(0x4271C294UL))
#define bFM_MFS14_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x4271C298UL))
#define bFM4_MFS14_LIN_FCR_FLST                   *((volatile  uint8_t *)(0x4271C298UL))
#define bFM_MFS14_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM4_MFS14_LIN_FCR_FSEL                   *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM_MFS14_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM4_MFS14_LIN_FCR_FTIE                   *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM_MFS14_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM4_MFS14_LIN_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM_MFS14_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM4_MFS14_LIN_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM_MFS14_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x4271C2B0UL))
#define bFM4_MFS14_LIN_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271C2B0UL))

#define bFM_MFS14_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x4271C020UL))
#define bFM4_MFS14_LIN_SCR_TXE                    *((volatile  uint8_t *)(0x4271C020UL))
#define bFM_MFS14_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x4271C024UL))
#define bFM4_MFS14_LIN_SCR_RXE                    *((volatile  uint8_t *)(0x4271C024UL))
#define bFM_MFS14_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x4271C028UL))
#define bFM4_MFS14_LIN_SCR_TBIE                   *((volatile  uint8_t *)(0x4271C028UL))
#define bFM_MFS14_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM4_MFS14_LIN_SCR_TIE                    *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM_MFS14_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x4271C030UL))
#define bFM4_MFS14_LIN_SCR_RIE                    *((volatile  uint8_t *)(0x4271C030UL))
#define bFM_MFS14_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x4271C034UL))
#define bFM4_MFS14_LIN_SCR_LBR                    *((volatile  uint8_t *)(0x4271C034UL))
#define bFM_MFS14_LIN_SCR_MS                      *((volatile  uint8_t *)(0x4271C038UL))
#define bFM4_MFS14_LIN_SCR_MS                     *((volatile  uint8_t *)(0x4271C038UL))
#define bFM_MFS14_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271C03CUL))
#define bFM4_MFS14_LIN_SCR_UPCL                   *((volatile  uint8_t *)(0x4271C03CUL))

#define bFM_MFS14_LIN_SMR_SOE                     *((volatile  uint8_t *)(0x4271C000UL))
#define bFM4_MFS14_LIN_SMR_SOE                    *((volatile  uint8_t *)(0x4271C000UL))
#define bFM_MFS14_LIN_SMR_SBL                     *((volatile  uint8_t *)(0x4271C00CUL))
#define bFM4_MFS14_LIN_SMR_SBL                    *((volatile  uint8_t *)(0x4271C00CUL))
#define bFM_MFS14_LIN_SMR_WUCR                    *((volatile  uint8_t *)(0x4271C010UL))
#define bFM4_MFS14_LIN_SMR_WUCR                   *((volatile  uint8_t *)(0x4271C010UL))

#define bFM_MFS14_LIN_SSR_TBI                     *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM4_MFS14_LIN_SSR_TBI                    *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM_MFS14_LIN_SSR_TDRE                    *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM4_MFS14_LIN_SSR_TDRE                   *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM_MFS14_LIN_SSR_RDRF                    *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM4_MFS14_LIN_SSR_RDRF                   *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM_MFS14_LIN_SSR_ORE                     *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM4_MFS14_LIN_SSR_ORE                    *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM_MFS14_LIN_SSR_FRE                     *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM4_MFS14_LIN_SSR_FRE                    *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM_MFS14_LIN_SSR_LBD                     *((volatile  uint8_t *)(0x4271C0B4UL))
#define bFM4_MFS14_LIN_SSR_LBD                    *((volatile  uint8_t *)(0x4271C0B4UL))
#define bFM_MFS14_LIN_SSR_REC                     *((volatile  uint8_t *)(0x4271C0BCUL))
#define bFM4_MFS14_LIN_SSR_REC                    *((volatile  uint8_t *)(0x4271C0BCUL))

#define bFM_MFS14_UART_BGR_EXT                    *((volatile  uint8_t *)(0x4271C1BCUL))
#define bFM4_MFS14_UART_BGR_EXT                   *((volatile  uint8_t *)(0x4271C1BCUL))

#define bFM_MFS14_UART_ESCR_P                     *((volatile  uint8_t *)(0x4271C08CUL))
#define bFM4_MFS14_UART_ESCR_P                    *((volatile  uint8_t *)(0x4271C08CUL))
#define bFM_MFS14_UART_ESCR_PEN                   *((volatile  uint8_t *)(0x4271C090UL))
#define bFM4_MFS14_UART_ESCR_PEN                  *((volatile  uint8_t *)(0x4271C090UL))
#define bFM_MFS14_UART_ESCR_INV                   *((volatile  uint8_t *)(0x4271C094UL))
#define bFM4_MFS14_UART_ESCR_INV                  *((volatile  uint8_t *)(0x4271C094UL))
#define bFM_MFS14_UART_ESCR_ESBL                  *((volatile  uint8_t *)(0x4271C098UL))
#define bFM4_MFS14_UART_ESCR_ESBL                 *((volatile  uint8_t *)(0x4271C098UL))
#define bFM_MFS14_UART_ESCR_FLWEN                 *((volatile  uint8_t *)(0x4271C09CUL))
#define bFM4_MFS14_UART_ESCR_FLWEN                *((volatile  uint8_t *)(0x4271C09CUL))

